---
kind: property
id: P:Autodesk.Revit.DB.FabricationConfigurationInfo.CloudId
source: html/50f059d3-4a5c-1810-34ea-c9d06e7f5ad9.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.CloudId Property

The identifier of the cloud configuration.

## Syntax (C#)
```csharp
public string CloudId { get; }
```